"""
4. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
"""


def PrintNumberInBin(number):
    number = format(19, "b")
    print(number)


PrintNumberInBin(5)
